module Tetraminos
  SHAPES = ['O', 'I', 'S', 'Z', 'L', 'J', 'T']
  
  O = [
    [1,1,],
    [1,1,]
  ]

  I = [
    [0,0,0,0],
    [1,1,1,1],
    [0,0,0,0],
    [0,0,0,0]
  ]

  S = [
    [0,1,1,0],
    [1,1,0,0]
  ]

  Z = [
    [1,1,0,0],
    [0,1,1,0]
  ]

  L = [
    [0,0,0,0],
    [1,0,0,0],
    [1,0,0,0],
    [1,1,0,0]
  ]  

  J = [
    [0,0,0,0],
    [0,1,0,0],
    [0,1,0,0],
    [1,1,0,0]
  ]

  T = [
    [0,0,0,0],
    [0,0,0,0],
    [1,1,1,0],
    [0,1,0,0]
  ]
  
  COLORS = {
    'O' => Gosu::Color::YELLOW, 
    'I' => Gosu::Color::CYAN,
    'S' => Gosu::Color::RED,
    'Z' => Gosu::Color::GREEN,
    'L' => Gosu::Color.rgba(255, 165, 0, 255), # Оранжевый цвет
    'J' => Gosu::Color.rgba(252, 15, 0, 192), # Розовый цвет
    'T' => Gosu::Color::FUCHSIA
  }

end